#include "searchreplacedata.h"

#include <iostream>
#include <fstream>
#include <string>
#include <vector>
#include <thread>
#include <mutex>
#include <chrono>
#include <filesystem> // –í —Å—Ç–∞–Ω–¥–∞—Ä—Ç–µ C++17 —ç—Ç–∞ –±–∏–±–ª–∏–æ—Ç–µ–∫–∞ –≤–∫–ª—é—á–µ–Ω–∞ –≤ —Å—Ç–∞–Ω–¥–∞—Ä—Ç–Ω—É—é –±–∏–±–ª–∏–æ—Ç–µ–∫—É —è–∑—ã–∫–∞.
#include <future>
#include <sstream>

using namespace std;
namespace fs = std::filesystem;

/*!
 \brief –ö–æ–Ω—Å—Ç—Ä—É–∫—Ç–æ—Ä.
 \param configFilePath –ø—É—Ç—å –¥–æ –∫–æ–Ω—Ñ–∏–≥ —Ñ–∞–π–ª–∞.
 \details –∏–Ω–∏—Ü–∏–∞–ª–∏–∑–∞—Ü–∏—è mConfigFilePath(–ø—É—Ç—å –¥–æ –∫–æ–Ω—Ñ–∏–≥ —Ñ–∞–π–ª–∞) –∏ mConfigFileData(–û–±—ä–µ–∫—Ç —Å—Ç—Ä—É–∫—Ç—É—Ä—ã, —Ö—Ä–∞–Ω—è—â–∏–π –¥–∞–Ω–Ω—ã–µ –∏–∑ –∫–æ–Ω—Ñ–∏–≥ —Ñ–∞–π–ª–∞).
 */
SearchReplaceData::SearchReplaceData(const string& configFilePath)
    : mConfigFilePath(configFilePath) {
    mConfigFileData = new ConfigFileData();
}

/*!
 \brief –î–µ—Å—Ç—Ä—É–∫—Ç–æ—Ä.
 \details –û—á–∏—Å—Ç–∫–∞ mConfigFileData.
 */
SearchReplaceData::~SearchReplaceData() {
    delete mConfigFileData;
}

/*!
<<<<<<< HEAD
 \brief parseFile ÙÛÌÍˆËˇ ÓÚÍ˚‚‡ÂÚ Ù‡ÈÎ, Á‡ÏÂÌˇÂÚ ‚ÒÂ ÁÌ‡˜ÂÌËˇ ‚ ÒÔËÒÍÂ Á‡ÏÂÌ replacements
        Ë Á‡ÔËÒ˚‚‡ÂÚ ËÁÏÂÌÂÌËˇ ‚ ÚÓÚ ÊÂ Ù‡ÈÎ.
 \param path ÔÛÚ¸ ‰Ó Ù‡ÈÎ‡
 \details 1. ◊ÚÂÌËÂ Ù‡ÈÎÓ‚: —Ì‡˜‡Î‡ ÒÓÁ‰‡ÂÚÒˇ Ó·˙ÂÍÚ ifstream ‰Îˇ ÓÚÍ˚ÚËˇ Ù‡ÈÎ‡ (ÔÛÚ¸ Í ÍÓÚÓÓÏÛ ÔÂÂ‰‡ÂÚÒˇ ‚ Ô‡‡ÏÂÚÂ ÙÛÌÍˆËË).
             ≈ÒÎË Ù‡ÈÎ ÌÂ Û‰‡ÎÓÒ¸ ÓÚÍ˚Ú¸, ‚˚‚Ó‰ËÚÒˇ ÒÓÓ·˘ÂÌËÂ Ó· Ó¯Ë·ÍÂ Ë ÙÛÌÍˆËˇ Á‡‚Â¯‡ÂÚÒˇ.
             «‡ÚÂÏ ÒÓÁ‰‡˛ÚÒˇ ÌÂÓ·ıÓ‰ËÏ˚Â ÔÂÂÏÂÌÌ˚Â: Ï¸˛ÚÂÍÒ (mutex), ÍÓÚÓ˚È ·Û‰ÂÚ ËÒÔÓÎ¸ÁÓ‚‡Ú¸Òˇ ‰Îˇ ·ÎÓÍËÓ‚ÍË ‰ÓÒÚÛÔ‡ Í Ù‡ÈÎÛ ËÁ ÌÂÒÍÓÎ¸ÍËı ÔÓÚÓÍÓ‚,
             ÍÓÎË˜ÂÒÚ‚Ó ÔÓÚÓÍÓ‚, ÍÓÚÓ˚Â ·Û‰ÛÚ ËÒÔÓÎ¸ÁÓ‚‡Ú¸Òˇ ‰Îˇ ˜ÚÂÌËˇ Ù‡ÈÎ‡, Ë ‚ÂÍÚÓ futures ‰Îˇ ı‡ÌÂÌËˇ ÂÁÛÎ¸Ú‡ÚÓ‚ ‡ÒËÌıÓÌÌ˚ı ÓÔÂ‡ˆËÈ ˜ÚÂÌËˇ Ù‡ÈÎ‡ ‚ ÒÚÓÍÛ.
             ƒ‡ÎÂÂ ‚ ˆËÍÎÂ ÒÓÁ‰‡˛ÚÒˇ Á‡‰‡˜Ë Ì‡ ˜ÚÂÌËÂ Ù‡ÈÎ‡ ‚ ÒÚÓÍÛ ‚ ÌÂÒÍÓÎ¸ÍÓ ÔÓÚÓÍÓ‚ Ò ÔÓÏÓ˘¸˛ ÙÛÌÍˆËË std::async Ë ‰Ó·‡‚Îˇ˛ÚÒˇ ‚ ‚ÂÍÚÓ futures.
              ‡Ê‰‡ˇ Á‡‰‡˜‡ ‚˚ÔÓÎÌˇÂÚÒˇ ‚ ÓÚ‰ÂÎ¸ÌÓÏ ÔÓÚÓÍÂ, ·ÎÓÍËÛˇ Ï¸˛ÚÂÍÒ ‰Îˇ ‰ÓÒÚÛÔ‡ Í Ù‡ÈÎÛ.
             œÓÒÎÂ Á‡‚Â¯ÂÌËˇ ‚˚ÔÓÎÌÂÌËˇ ‚ÒÂı Á‡‰‡˜ ËÁ ‚ÂÍÚÓ‡ futures ÔÓÎÛ˜ÂÌÌ˚Â ÒÚÓÍË ÍÓÌÍ‡ÚÂÌËÛ˛ÚÒˇ ‚ Ó‰ÌÛ ÒÚÓÍÛ.
             œÓÒÎÂ ˜ÚÂÌËˇ Ù‡ÈÎ‡ Ù‡ÈÎ Á‡Í˚‚‡ÂÚÒˇ.
          2. «‡ÏÂÌ‡ ¯‡·ÎÓÌÓ‚: —Ì‡˜‡Î‡ ËÁ ÍÓÌÙË„Û‡ˆËÓÌÌÓ„Ó Ù‡ÈÎ‡ ÔÓÎÛ˜‡˛ÚÒˇ ‚ÒÂ ÌÂÓ·ıÓ‰ËÏ˚Â Ô‡˚ ÁÌ‡˜ÂÌËÈ ‰Îˇ Á‡ÏÂÌ˚,
             ÍÓÚÓ˚Â ÒÓı‡Ìˇ˛ÚÒˇ ‚ ‚ÂÍÚÓÂ replacements.
             «‡ÚÂÏ, ‰Îˇ Í‡Ê‰ÓÈ Ô‡˚ ÁÌ‡˜ÂÌËÈ ËÁ ‚ÂÍÚÓ‡ ÔÓËÁ‚Ó‰ËÚÒˇ Á‡ÏÂÌ‡ ‚ÒÂı ‚ıÓÊ‰ÂÌËÈ ¯‡·ÎÓÌ‡ r.first ‚ ÒÚÓÍÂ contents Ì‡ ÒÓÓÚ‚ÂÚÒÚ‚Û˛˘ÂÂ ÁÌ‡˜ÂÌËÂ r.second.
             ƒÎˇ ˝ÚÓ„Ó ËÒÔÓÎ¸ÁÛÂÚÒˇ ˆËÍÎ while, ÍÓÚÓ˚È ÔÓıÓ‰ËÚ ÔÓ ‚ÒÂÏ ‚ıÓÊ‰ÂÌËˇÏ ¯‡·ÎÓÌ‡ ‚ ÒÚÓÍÂ.
             ¬ÌÛÚË ˆËÍÎ‡ Ì‡ıÓ‰ËÚÒˇ ‚˚ÁÓ‚ ÏÂÚÓ‰‡ replace(), ÍÓÚÓ˚È Á‡ÏÂÌˇÂÚ ‚ıÓÊ‰ÂÌËÂ ¯‡·ÎÓÌ‡ ‚ ÒÚÓÍÂ Ì‡ ÒÓÓÚ‚ÂÚÒÚ‚Û˛˘ÂÂ ÁÌ‡˜ÂÌËÂ Ë Ó·ÌÓ‚ÎˇÂÚ ÔÓÁËˆË˛,
             Ì‡ ÍÓÚÓÓÈ ÌÛÊÌÓ Ì‡˜‡Ú¸ ÒÎÂ‰Û˛˘ËÈ ÔÓËÒÍ, Û‚ÂÎË˜Ë‚‡ˇ ÂÂ Ì‡ ‰ÎËÌÛ Á‡ÏÂÌÂÌÌÓ„Ó ÚÂÍÒÚ‡.
             œÓÒÎÂ Á‡‚Â¯ÂÌËˇ Á‡ÏÂÌ ‚ÒÂı ¯‡·ÎÓÌÓ‚, ÒÚÓÍ‡ contents ÒÓ‰ÂÊËÚ ËÁÏÂÌÂÌÌ˚È ÚÂÍÒÚ.
=======
 \brief parseFile —Ñ—É–Ω–∫—Ü–∏—è –æ—Ç–∫—Ä—ã–≤–∞–µ—Ç —Ñ–∞–π–ª, –∑–∞–º–µ–Ω—è–µ—Ç –≤—Å–µ –∑–Ω–∞—á–µ–Ω–∏—è –≤ —Å–ø–∏—Å–∫–µ –∑–∞–º–µ–Ω replacements
        –∏ –∑–∞–ø–∏—Å—ã–≤–∞–µ—Ç –∏–∑–º–µ–Ω–µ–Ω–∏—è –≤ —Ç–æ—Ç –∂–µ —Ñ–∞–π–ª.
 \param path –ø—É—Ç—å –¥–æ —Ñ–∞–π–ª–∞
 \details 1. –ß—Ç–µ–Ω–∏–µ —Ñ–∞–π–ª–æ–≤: –°–Ω–∞—á–∞–ª–∞ —Å–æ–∑–¥–∞–µ—Ç—Å—è –æ–±—ä–µ–∫—Ç ifstream –¥–ª—è –æ—Ç–∫—Ä—ã—Ç–∏—è —Ñ–∞–π–ª–∞ (–ø—É—Ç—å –∫ –∫–æ—Ç–æ—Ä–æ–º—É –ø–µ—Ä–µ–¥–∞–µ—Ç—Å—è –≤ –ø–∞—Ä–∞–º–µ—Ç—Ä–µ —Ñ—É–Ω–∫—Ü–∏–∏). 
             –ï—Å–ª–∏ —Ñ–∞–π–ª –Ω–µ —É–¥–∞–ª–æ—Å—å –æ—Ç–∫—Ä—ã—Ç—å, –≤—ã–≤–æ–¥–∏—Ç—Å—è —Å–æ–æ–±—â–µ–Ω–∏–µ –æ–± –æ—à–∏–±–∫–µ –∏ —Ñ—É–Ω–∫—Ü–∏—è –∑–∞–≤–µ—Ä—à–∞–µ—Ç—Å—è. 
             –ó–∞—Ç–µ–º —Å–æ–∑–¥–∞—é—Ç—Å—è –Ω–µ–æ–±—Ö–æ–¥–∏–º—ã–µ –ø–µ—Ä–µ–º–µ–Ω–Ω—ã–µ: –º—å—é—Ç–µ–∫—Å (mutex), –∫–æ—Ç–æ—Ä—ã–π –±—É–¥–µ—Ç –∏—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å—Å—è –¥–ª—è –±–ª–æ–∫–∏—Ä–æ–≤–∫–∏ –¥–æ—Å—Ç—É–ø–∞ –∫ —Ñ–∞–π–ª—É –∏–∑ –Ω–µ—Å–∫–æ–ª—å–∫–∏—Ö –ø–æ—Ç–æ–∫–æ–≤, 
             –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø–æ—Ç–æ–∫–æ–≤, –∫–æ—Ç–æ—Ä—ã–µ –±—É–¥—É—Ç –∏—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å—Å—è –¥–ª—è —á—Ç–µ–Ω–∏—è —Ñ–∞–π–ª–∞, –∏ –≤–µ–∫—Ç–æ—Ä futures –¥–ª—è —Ö—Ä–∞–Ω–µ–Ω–∏—è —Ä–µ–∑—É–ª—å—Ç–∞—Ç–æ–≤ –∞—Å–∏–Ω—Ö—Ä–æ–Ω–Ω—ã—Ö –æ–ø–µ—Ä–∞—Ü–∏–π —á—Ç–µ–Ω–∏—è —Ñ–∞–π–ª–∞ –≤ —Å—Ç—Ä–æ–∫—É. 
             –î–∞–ª–µ–µ –≤ —Ü–∏–∫–ª–µ —Å–æ–∑–¥–∞—é—Ç—Å—è –∑–∞–¥–∞—á–∏ –Ω–∞ —á—Ç–µ–Ω–∏–µ —Ñ–∞–π–ª–∞ –≤ —Å—Ç—Ä–æ–∫—É –≤ –Ω–µ—Å–∫–æ–ª—å–∫–æ –ø–æ—Ç–æ–∫–æ–≤ —Å –ø–æ–º–æ—â—å—é —Ñ—É–Ω–∫—Ü–∏–∏ std::async –∏ –¥–æ–±–∞–≤–ª—è—é—Ç—Å—è –≤ –≤–µ–∫—Ç–æ—Ä futures. 
             –ö–∞–∂–¥–∞—è –∑–∞–¥–∞—á–∞ –≤—ã–ø–æ–ª–Ω—è–µ—Ç—Å—è –≤ –æ—Ç–¥–µ–ª—å–Ω–æ–º –ø–æ—Ç–æ–∫–µ, –±–ª–æ–∫–∏—Ä—É—è –º—å—é—Ç–µ–∫—Å –¥–ª—è –¥–æ—Å—Ç—É–ø–∞ –∫ —Ñ–∞–π–ª—É. 
             –ü–æ—Å–ª–µ –∑–∞–≤–µ—Ä—à–µ–Ω–∏—è –≤—ã–ø–æ–ª–Ω–µ–Ω–∏—è –≤—Å–µ—Ö –∑–∞–¥–∞—á –∏–∑ –≤–µ–∫—Ç–æ—Ä–∞ futures –ø–æ–ª—É—á–µ–Ω–Ω—ã–µ —Å—Ç—Ä–æ–∫–∏ –∫–æ–Ω–∫–∞—Ç–µ–Ω–∏—Ä—É—é—Ç—Å—è –≤ –æ–¥–Ω—É —Å—Ç—Ä–æ–∫—É.
             –ü–æ—Å–ª–µ —á—Ç–µ–Ω–∏—è —Ñ–∞–π–ª–∞ —Ñ–∞–π–ª –∑–∞–∫—Ä—ã–≤–∞–µ—Ç—Å—è. 
          2. –ó–∞–º–µ–Ω–∞ —à–∞–±–ª–æ–Ω–æ–≤: –°–Ω–∞—á–∞–ª–∞ –∏–∑ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–æ–Ω–Ω–æ–≥–æ —Ñ–∞–π–ª–∞ –ø–æ–ª—É—á–∞—é—Ç—Å—è –≤—Å–µ –Ω–µ–æ–±—Ö–æ–¥–∏–º—ã–µ –ø–∞—Ä—ã –∑–Ω–∞—á–µ–Ω–∏–π –¥–ª—è –∑–∞–º–µ–Ω—ã, 
             –∫–æ—Ç–æ—Ä—ã–µ —Å–æ—Ö—Ä–∞–Ω—è—é—Ç—Å—è –≤ –≤–µ–∫—Ç–æ—Ä–µ replacements. 
             –ó–∞—Ç–µ–º, –¥–ª—è –∫–∞–∂–¥–æ–π –ø–∞—Ä—ã –∑–Ω–∞—á–µ–Ω–∏–π –∏–∑ –≤–µ–∫—Ç–æ—Ä–∞ –ø—Ä–æ–∏–∑–≤–æ–¥–∏—Ç—Å—è –∑–∞–º–µ–Ω–∞ –≤—Å–µ—Ö –≤—Ö–æ–∂–¥–µ–Ω–∏–π —à–∞–±–ª–æ–Ω–∞ r.first –≤ —Å—Ç—Ä–æ–∫–µ contents –Ω–∞ —Å–æ–æ—Ç–≤–µ—Ç—Å—Ç–≤—É—é—â–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ r.second. 
             –î–ª—è —ç—Ç–æ–≥–æ –∏—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è —Ü–∏–∫–ª while, –∫–æ—Ç–æ—Ä—ã–π –ø—Ä–æ—Ö–æ–¥–∏—Ç –ø–æ –≤—Å–µ–º –≤—Ö–æ–∂–¥–µ–Ω–∏—è–º —à–∞–±–ª–æ–Ω–∞ –≤ —Å—Ç—Ä–æ–∫–µ. 
             –í–Ω—É—Ç—Ä–∏ —Ü–∏–∫–ª–∞ –Ω–∞—Ö–æ–¥–∏—Ç—Å—è –≤—ã–∑–æ–≤ –º–µ—Ç–æ–¥–∞ replace(), –∫–æ—Ç–æ—Ä—ã–π –∑–∞–º–µ–Ω—è–µ—Ç –≤—Ö–æ–∂–¥–µ–Ω–∏–µ —à–∞–±–ª–æ–Ω–∞ –≤ —Å—Ç—Ä–æ–∫–µ –Ω–∞ —Å–æ–æ—Ç–≤–µ—Ç—Å—Ç–≤—É—é—â–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –∏ –æ–±–Ω–æ–≤–ª—è–µ—Ç –ø–æ–∑–∏—Ü–∏—é, 
             –Ω–∞ –∫–æ—Ç–æ—Ä–æ–π –Ω—É–∂–Ω–æ –Ω–∞—á–∞—Ç—å —Å–ª–µ–¥—É—é—â–∏–π –ø–æ–∏—Å–∫, —É–≤–µ–ª–∏—á–∏–≤–∞—è –µ–µ –Ω–∞ –¥–ª–∏–Ω—É –∑–∞–º–µ–Ω–µ–Ω–Ω–æ–≥–æ —Ç–µ–∫—Å—Ç–∞. 
             –ü–æ—Å–ª–µ –∑–∞–≤–µ—Ä—à–µ–Ω–∏—è –∑–∞–º–µ–Ω –≤—Å–µ—Ö —à–∞–±–ª–æ–Ω–æ–≤, —Å—Ç—Ä–æ–∫–∞ contents —Å–æ–¥–µ—Ä–∂–∏—Ç –∏–∑–º–µ–Ω–µ–Ω–Ω—ã–π —Ç–µ–∫—Å—Ç.
>>>>>>> 5bd75ca7c48397f2c49f43370fe79f832051e44e
*/
void SearchReplaceData::parseFile(const string& path) {
    ifstream file(path);
    if (!file.is_open()){
        std::cout << "Failed to open file: " << path << std::endl;
        return;
    }
    mutex m;
    int numTreads = mConfigFileData->numThreads;
    std::vector<std::future<std::string>> futures;

    for (int i = 0; i < numTreads; i++) {
        futures.push_back(std::async(std::launch::async, [&file, &m]() {
            lock_guard<mutex> lock(m);
            std::stringstream ss;
            ss << file.rdbuf();
            return ss.str();
            }));
    }

    string contents = "";
    for (auto& future : futures) {
        contents += future.get();
    }

    file.close();

    std::vector<std::pair<std::string, std::string>> replacements = mConfigFileData->replacements;

    for (auto r : replacements) {
        size_t pos = 0;
        while ((pos = contents.find(r.first, pos)) != string::npos) {
            contents.replace(pos, r.first.length(), r.second);
            pos += r.second.length();
        }
    }

    ofstream outfile(path);
    if (!outfile.is_open()) {
        std::cout << "Failed to open file: " << path << std::endl;
        return;
    }
    outfile << contents;
    outfile.close();
}

/*!
<<<<<<< HEAD
 \brief parseDirectory ÙÛÌÍˆËˇ ÔÓıÓ‰ËÚ ÂÍÛÒË‚ÌÓ ÔÓ ‚ÒÂÏ Ù‡ÈÎ‡Ï ‚ ÛÍ‡Á‡ÌÌÓÏ Í‡Ú‡ÎÓ„Â
        Ë Á‡ÔÛÒÍ‡ÂÚ parseFile ‰Îˇ Í‡Ê‰Ó„Ó Ó·Ì‡ÛÊÂÌÌÓ„Ó Ù‡ÈÎ‡.
 \details ƒ‡ÌÌ‡ˇ ÙÛÌÍˆËˇ ÓÚ‚Â˜‡ÂÚ Á‡ Ó·ıÓ‰ Ë Ô‡ÒËÌ„ Ù‡ÈÎÓ‚ ‚ ÛÍ‡Á‡ÌÌÓÈ ‰ËÂÍÚÓËË Ë Â∏ ÔÓ‰‰ËÂÍÚÓËˇı.
          —Ì‡˜‡Î‡ ËÁ ÍÓÌÙË„Û‡ˆËÓÌÌÓ„Ó Ù‡ÈÎ‡ ÔÓÎÛ˜‡ÂÚÒˇ ÍÓÎË˜ÂÒÚ‚Ó ÔÓÚÓÍÓ‚ numThreads Ë ‡‰ÂÒ ÍÓÌÂ‚ÓÈ ‰ËÂÍÚÓËË path.
          «‡ÚÂÏ ÒÓÁ‰‡ÂÚÒˇ ‚ÂÍÚÓ ÔÓÚÓÍÓ‚ threads, ‚ ÍÓÚÓ˚È ·Û‰ÛÚ ‰Ó·‡‚ÎˇÚ¸Òˇ ÔÓÚÓÍË ‰Îˇ Ô‡ÒËÌ„‡ Í‡Ê‰Ó„Ó Ù‡ÈÎ‡.

          ƒ‡ÎÂÂ Ì‡˜ËÌ‡ÂÚÒˇ ÂÍÛÒË‚Ì˚È Ó·ıÓ‰ ‚ÒÂı Ù‡ÈÎÓ‚ ‚ ‰ËÂÍÚÓËË Ë ÂÂ ÔÓ‰‰ËÂÍÚÓËˇı.
          ≈ÒÎË Ù‡ÈÎ ÌÂ ˇ‚ÎˇÂÚÒˇ Ó·˚˜Ì˚Ï Ù‡ÈÎÓÏ, ÚÓ ÓÌ ÔÓÔÛÒÍ‡ÂÚÒˇ.
          ƒÎˇ Í‡Ê‰Ó„Ó Ó·˚˜ÌÓ„Ó Ù‡ÈÎ‡ ÒÓÁ‰‡ÂÚÒˇ ÔÓÚÓÍ, ÍÓÚÓ˚È Á‡ÔÛÒÍ‡ÂÚ ÙÛÌÍˆË˛ parseFile ‰Îˇ Â„Ó Ô‡ÒËÌ„‡.
          œË ‰ÓÒÚËÊÂÌËË Ï‡ÍÒËÏ‡Î¸ÌÓ„Ó ÍÓÎË˜ÂÒÚ‚‡ ÔÓÚÓÍÓ‚ (numThreads) ‚ÒÂ Á‡ÔÛ˘ÂÌÌ˚Â ÔÓÚÓÍË Á‡‚Â¯‡˛ÚÒˇ Ë ÓÒ‚Ó·ÓÊ‰‡˛ÚÒˇ,
          ‡ ÌÓ‚˚Â ÔÓÚÓÍË ‰Îˇ Ô‡ÒËÌ„‡ Ù‡ÈÎÓ‚ Ì‡˜ËÌ‡˛ÚÒˇ Ò ÌÓ‚ÓÈ ÔÓˆËË Ù‡ÈÎÓ‚.

          œÓÒÎÂ ÚÓ„Ó, Í‡Í ·˚ÎË Á‡ÔÛ˘ÂÌ˚ ÔÓÚÓÍË ‰Îˇ ‚ÒÂı Ù‡ÈÎÓ‚, ÍÓÚÓ˚Â ÌÂÓ·ıÓ‰ËÏÓ Ó·‡·ÓÚ‡Ú¸,
          ÓÒÚ‡‚¯ËÂÒˇ ÔÓÚÓÍË Á‡‚Â¯‡˛Ú Ò‚Ó˛ ‡·ÓÚÛ Ë ÓÒ‚Ó·ÓÊ‰‡˛ÚÒˇ.
=======
 \brief parseDirectory —Ñ—É–Ω–∫—Ü–∏—è –ø—Ä–æ—Ö–æ–¥–∏—Ç —Ä–µ–∫—É—Ä—Å–∏–≤–Ω–æ –ø–æ –≤—Å–µ–º —Ñ–∞–π–ª–∞–º –≤ —É–∫–∞–∑–∞–Ω–Ω–æ–º –∫–∞—Ç–∞–ª–æ–≥–µ
        –∏ –∑–∞–ø—É—Å–∫–∞–µ—Ç parseFile –¥–ª—è –∫–∞–∂–¥–æ–≥–æ –æ–±–Ω–∞—Ä—É–∂–µ–Ω–Ω–æ–≥–æ —Ñ–∞–π–ª–∞.
 \details –î–∞–Ω–Ω–∞—è —Ñ—É–Ω–∫—Ü–∏—è –æ—Ç–≤–µ—á–∞–µ—Ç –∑–∞ –æ–±—Ö–æ–¥ –∏ –ø–∞—Ä—Å–∏–Ω–≥ —Ñ–∞–π–ª–æ–≤ –≤ —É–∫–∞–∑–∞–Ω–Ω–æ–π –¥–∏—Ä–µ–∫—Ç–æ—Ä–∏–∏ –∏ –µ—ë –ø–æ–¥–¥–∏—Ä–µ–∫—Ç–æ—Ä–∏—è—Ö. 
          –°–Ω–∞—á–∞–ª–∞ –∏–∑ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–æ–Ω–Ω–æ–≥–æ —Ñ–∞–π–ª–∞ –ø–æ–ª—É—á–∞–µ—Ç—Å—è –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø–æ—Ç–æ–∫–æ–≤ numThreads –∏ –∞–¥—Ä–µ—Å –∫–æ—Ä–Ω–µ–≤–æ–π –¥–∏—Ä–µ–∫—Ç–æ—Ä–∏–∏ path. 
          –ó–∞—Ç–µ–º —Å–æ–∑–¥–∞–µ—Ç—Å—è –≤–µ–∫—Ç–æ—Ä –ø–æ—Ç–æ–∫–æ–≤ threads, –≤ –∫–æ—Ç–æ—Ä—ã–π –±—É–¥—É—Ç –¥–æ–±–∞–≤–ª—è—Ç—å—Å—è –ø–æ—Ç–æ–∫–∏ –¥–ª—è –ø–∞—Ä—Å–∏–Ω–≥–∞ –∫–∞–∂–¥–æ–≥–æ —Ñ–∞–π–ª–∞.

          –î–∞–ª–µ–µ –Ω–∞—á–∏–Ω–∞–µ—Ç—Å—è —Ä–µ–∫—É—Ä—Å–∏–≤–Ω—ã–π –æ–±—Ö–æ–¥ –≤—Å–µ—Ö —Ñ–∞–π–ª–æ–≤ –≤ –¥–∏—Ä–µ–∫—Ç–æ—Ä–∏–∏ –∏ –µ–µ –ø–æ–¥–¥–∏—Ä–µ–∫—Ç–æ—Ä–∏—è—Ö. 
          –ï—Å–ª–∏ —Ñ–∞–π–ª –Ω–µ —è–≤–ª—è–µ—Ç—Å—è –æ–±—ã—á–Ω—ã–º —Ñ–∞–π–ª–æ–º, —Ç–æ –æ–Ω –ø—Ä–æ–ø—É—Å–∫–∞–µ—Ç—Å—è. 
          –î–ª—è –∫–∞–∂–¥–æ–≥–æ –æ–±—ã—á–Ω–æ–≥–æ —Ñ–∞–π–ª–∞ —Å–æ–∑–¥–∞–µ—Ç—Å—è –ø–æ—Ç–æ–∫, –∫–æ—Ç–æ—Ä—ã–π –∑–∞–ø—É—Å–∫–∞–µ—Ç —Ñ—É–Ω–∫—Ü–∏—é parseFile –¥–ª—è –µ–≥–æ –ø–∞—Ä—Å–∏–Ω–≥–∞. 
          –ü—Ä–∏ –¥–æ—Å—Ç–∏–∂–µ–Ω–∏–∏ –º–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–≥–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤–∞ –ø–æ—Ç–æ–∫–æ–≤ (numThreads) –≤—Å–µ –∑–∞–ø—É—â–µ–Ω–Ω—ã–µ –ø–æ—Ç–æ–∫–∏ –∑–∞–≤–µ—Ä—à–∞—é—Ç—Å—è –∏ –æ—Å–≤–æ–±–æ–∂–¥–∞—é—Ç—Å—è, 
          –∞ –Ω–æ–≤—ã–µ –ø–æ—Ç–æ–∫–∏ –¥–ª—è –ø–∞—Ä—Å–∏–Ω–≥–∞ —Ñ–∞–π–ª–æ–≤ –Ω–∞—á–∏–Ω–∞—é—Ç—Å—è —Å –Ω–æ–≤–æ–π –ø–æ—Ä—Ü–∏–∏ —Ñ–∞–π–ª–æ–≤.

          –ü–æ—Å–ª–µ —Ç–æ–≥–æ, –∫–∞–∫ –±—ã–ª–∏ –∑–∞–ø—É—â–µ–Ω—ã –ø–æ—Ç–æ–∫–∏ –¥–ª—è –≤—Å–µ—Ö —Ñ–∞–π–ª–æ–≤, –∫–æ—Ç–æ—Ä—ã–µ –Ω–µ–æ–±—Ö–æ–¥–∏–º–æ –æ–±—Ä–∞–±–æ—Ç–∞—Ç—å, 
          –æ—Å—Ç–∞–≤—à–∏–µ—Å—è –ø–æ—Ç–æ–∫–∏ –∑–∞–≤–µ—Ä—à–∞—é—Ç —Å–≤–æ—é —Ä–∞–±–æ—Ç—É –∏ –æ—Å–≤–æ–±–æ–∂–¥–∞—é—Ç—Å—è. 
>>>>>>> 5bd75ca7c48397f2c49f43370fe79f832051e44e
*/
void SearchReplaceData::parseDirectory() {
    int numThreads = mConfigFileData->numThreads;
    string path = mConfigFileData->rootDir;
    vector<thread> threads;
    if (!std::filesystem::exists(path)){
        cerr << "Error opening the directory: " << path << endl;
        return;
    }
    for (auto& entry : fs::recursive_directory_iterator(path)) {
        if (!entry.is_regular_file()) {
            continue;
        }
        string entryPath = entry.path().string();
        threads.push_back(thread(&SearchReplaceData::parseFile, this, entryPath));
        if (static_cast<int>(threads.size()) >= numThreads) {
            for (auto& t : threads) {
                t.join();
            }
            threads.clear();
        }
    }
    for (auto& t : threads) {
        t.join();
    }
}

/*!
 \brief parseConfig —Ñ—É–Ω–∫—Ü–∏—è —á–∏—Ç–∞–µ—Ç –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–æ–Ω–Ω—ã–π —Ñ–∞–π–ª
        –∏ –∑–∞–ø–æ–ª–Ω—è–µ—Ç —Å—Ç—Ä—É–∫—Ç—É—Ä—É configFileData –¥–∞–Ω–Ω—ã–º–∏ –∏–∑ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–æ–Ω–Ω–æ–≥–æ —Ñ–∞–π–ª–∞.
 \return true, –µ—Å–ª–∏ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–æ–Ω–Ω—ã–π —Ñ–∞–π–ª –±—ã–ª —É—Å–ø–µ—à–Ω–æ –ø—Ä–æ—á–∏—Ç–∞–Ω, –∏ false –≤ –ø—Ä–æ—Ç–∏–≤–Ω–æ–º —Å–ª—É—á–∞–µ.
*/
bool SearchReplaceData::parseConfig() {
    ifstream config(mConfigFilePath);

    if (config.is_open()) {
        string line;
        while (getline(config, line)) {
            if (line.empty()) {
                continue;
            }
            size_t delim = line.find('=');
            if (delim == string::npos) {
                cerr << "Invalid line in config file: " << line << endl;
                continue;
            }
            string key = line.substr(0, delim);
            string value = line.substr(delim + 1);
            if (key == "numThreads") {
                mConfigFileData->numThreads = stoi(value);
            }
            else if (key == "rootDir") {
                mConfigFileData->rootDir = value;
            }
            else {
                mConfigFileData->replacements.push_back({ key, value });
            }
        }
        config.close();
    }
    else {
        return false;
    }

    return true;
}


